@carmine73 
Thanks for the tip.
I tried with this VM:

```hcl
resource "vcd_vapp_vm" "myvm" {
  org           = "datacloud"
  vdc           = "vdc-datacloud"
  vapp_name     = vcd_vapp.myvapp.name
  name          = "myvm"
  computer_name = "myvm-unique"
  catalog_name  = "cat-datacloud"
  template_name = "photon-hw11"
  power_on      = false
  memory        = 1024
  cpus          = 2
  cpu_cores     = 1
}
```

When I change it to
```hcl
resource "vcd_vapp_vm" "myvm" {
  org              = "datacloud"
  vdc              = "vdc-datacloud"
  vapp_name        = vcd_vapp.myvapp.name
  name             = "myvm"
  computer_name    = "myvm-unique"
  vapp_template_id = data.vcd_catalog_vapp_template.tmpl.id
  power_on         = false
  memory           = 1024
  cpus             = 2
  cpu_cores        = 1
  lifecycle {
    ignore_changes = [
      vapp_template_id
    ]
  }
}
```
I still get an attempt to removal
```
  # vcd_vapp_vm.myvm must be replaced
-/+ resource "vcd_vapp_vm" "myvm" {
      - catalog_name                   = "cat-datacloud" -> null
      ~ cpu_limit                      = 2000 -> (known after apply)
      ~ cpu_priority                   = "NORMAL" -> (known after apply)
      ~ cpu_reservation                = 400 -> (known after apply)
      ~ cpu_shares                     = 2000 -> (known after apply)
      [...]
      - template_name                  = "photon-hw11" -> null # forces replacement
      + vapp_template_id               = "urn:vcloud:vapptemplate:1a4dca10-9b87-4f99-88b9-aefd0a8cd529" # forces replacement
      ~ vm_type                        = "vcd_vapp_vm" -> (known after apply)
        # (13 unchanged attributes hidden)
```
It is not only the addition of `vapp_template_id` that forces replacement, but also the removal of `template_name`.

Is there some more detail to add ?
Side note: if I add `catalog_name` and `template_name` to `lifecycle.ignore_change`, we're back to the "_Argument is deprecated_" warning

